ka2_2024/src/Enums/ВидыНалогов/ВидыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНалогов</name>
  <enumValues>
    <name>Госпошлина_ГосрегистрацияОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_ВредныеУсловия</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВзносы_ПФР_Шахтеры</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ВнутригородскойОкруг</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородскоеПоселение</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородскойОкруг</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_ГородФедеральногоЗначения</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_МежселеннаяТерритория</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_СельскоеПоселение</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог_МуниципальныйОкруг</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмуществоЕСГС</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрофессиональныйДоход</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ДоходыСвышеПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП_НалоговаяБазаСвышеПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ВнутригородскойРайон</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ГородскойОкруг</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ГородскойОкругСВнутригородскимДелением</name>
  </enumValues>
  <enumValues>
    <name>ПСН_ГородФедеральногоЗначения</name>
  </enumValues>
  <enumValues>
    <name>ПСН_МуниципальныйРайон</name>
  </enumValues>
  <enumValues>
    <name>ПСН_МуниципальныйОкруг</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ПФР_Добровольные</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ПФР_СтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ФСС</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ФСС_НСиПЗ</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_ПФР_Добровольные</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ФиксированныеВзносы_СвышеПредела</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ОПС_ИностранныеРаботники</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ОМС_ИностранныеРаботники</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносы_ОСС_ИностранныеРаботники</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ВидыНалоговВзносов/ВидыНалоговВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалоговВзносов</name>
  <predefined>
    <items>
      <name>ЕдиныйНалоговыйПлатеж</name>
      <description>Единый налоговый платеж</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>ЕНВД</description>
    </items>
    <items>
      <name>ЕСХН</name>
      <description>ЕСХН</description>
    </items>
    <items>
      <name>ЗемельныйНалог</name>
      <description>Земельный налог</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество организаций</description>
    </items>
    <items>
      <name>НалогНаПрибыль_РегиональныйБюджет</name>
      <description>Налог на прибыль, региональный бюджет</description>
    </items>
    <items>
      <name>НалогНаПрибыль_ФедеральныйБюджет</name>
      <description>Налог на прибыль, федеральный бюджет</description>
    </items>
    <items>
      <name>НДС</name>
      <description>НДС</description>
    </items>
    <items>
      <name>НДС_ВвозимыеТовары</name>
      <description>НДС при импорте товаров из ЕАЭС</description>
    </items>
    <items>
      <name>НДС_НалоговыйАгент</name>
      <description>НДС при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ_ИП</name>
      <description>НДФЛ индивидуального предпринимателя </description>
    </items>
    <items>
      <name>ПрочиеНалогиИСборы</name>
      <description>Прочие налоги и сборы</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ТранспортныйНалог</name>
      <description>Транспортный налог организаций</description>
    </items>
    <items>
      <name>УСН_Доходы</name>
      <description>Налог при УСН (доходы)</description>
    </items>
    <items>
      <name>УСН_ДоходыМинусРасходы</name>
      <description>Налог при УСН (доходы минус расходы)</description>
    </items>
    <items>
      <name>УСН_МинимальныйНалог</name>
      <description>Минимальный налог УСН</description>
    </items>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>ПФР - по суммарному тарифу с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРСтраховаяЧасть</name>
      <description>Страховые взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительнаяЧасть</name>
      <description>Страховые взносы в ПФР, накопительная часть (до 2014 г.)</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифЛЭ</name>
      <description>Взносы на выплату доплат к пенсии членам летных экипажей</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифШахтеры</name>
      <description>Взносы в ПФР (дополнительный тариф шахтеров)</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)</description>
    </items>
    <items>
      <name>ПФРСПревышения</name>
      <description>ПФР - с базы сверх предельной величины, с 1 января 2016 года</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>ТФОМС</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССНС</name>
      <description>Страховые взносы от несчастных случаев</description>
    </items>
    <items>
      <name>НДФЛДоходыКонтрагентов</name>
      <description>НДФЛ с доходов контрагентов</description>
    </items>
    <items>
      <name>НДФЛДивиденды</name>
      <description>НДФЛ с дивидендов</description>
    </items>
    <items>
      <name>НДФЛДивидендыСотрудникам</name>
      <description>НДФЛ с дивидендов работникам</description>
    </items>
    <items>
      <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
      <description>НДФЛ, доначисленный по результатам проверки</description>
    </items>
    <items>
      <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
      <description>НДФЛ передача задолженности в налоговый орган</description>
    </items>
    <items>
      <name>НДФЛПрочиеРасчетыСПерсоналом</name>
      <description>НДФЛ с доходов по прочим операциям с персоналом</description>
    </items>
    <items>
      <name>НДФЛСПревышения</name>
      <description>НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом</description>
    </items>
    <items>
      <name>НДФЛДивидендыСПревышения</name>
      <description>НДФЛ с дивидендов свыше предельной величины</description>
    </items>
    <items>
      <name>ПФРДоПредельнойВеличины</name>
      <description>ПФР - с базы до предельной величины</description>
    </items>
    <items>
      <name>НДС_ОбратноеОбложение</name>
      <description>НДС налогового агента по отдельным видам товаров</description>
    </items>
    <items>
      <name>АУСН</name>
      <description>Налог при АУСН</description>
    </items>
    <items>
      <name>СтраховыеВзносыЕдиныйТариф</name>
      <description>Страховые взносы по единому тарифу</description>
    </items>
    <items>
      <name>ОПСИностранныхРаботников</name>
      <description>Взносы на пенсионное страхование иностранных работников</description>
    </items>
    <items>
      <name>ОМСИностранныхРаботников</name>
      <description>Взносы на медицинское страхование иностранных работников</description>
    </items>
    <items>
      <name>ОССИностранныхРаботников</name>
      <description>Взносы на социальное страхование иностранных работников</description>
    </items>
    <items>
      <name>НалогНаПрибыль_НалоговыйАгент</name>
      <description>Налог на прибыль при исполнении обязанностей налогового агента</description>
    </items>
  </predefined>
  <attributes>
    <name>ПлательщикСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ka2_2024/src/CommonModules/ЕдиныйНалоговыйСчетПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция ОбслуживаемыеСчетаУчета(Период) Экспорт
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНалогам);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоСоциальномуСтрахованию);
	
	СчетаПоОтбору = БухгалтерскийУчет.СформироватьМассивСубсчетов(МассивСчетов);
	
	СчетаИсключения = Новый Массив;
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ);
	СчетаИсключения.Добавить(ПланыСчетов.Хозрасчетный.ФСС_СтраховойГод);
	
	Для Каждого СчетИсключения Из СчетаИсключения Цикл
		ИндексЗаписи = СчетаПоОтбору.Найти(СчетИсключения);
		Если ИндексЗаписи <> Неопределено Тогда
			СчетаПоОтбору.Удалить(ИндексЗаписи);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СчетаПоОтбору;
	
КонецФункции

Функция ВидыНалоговУплачиваемыеОтдельно() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ЕдиныйНалоговыйПлатеж);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_Добровольные);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_Добровольные);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрофессиональныйДоход);
	
	Возврат МассивВидовНалогов
	
КонецФункции

Функция МассивДоступныхВидовНалогов() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ПустаяСсылка());
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.ПрочиеНалогиИСборы);
	МассивВидовНалогов.Добавить(Перечисления.ВидыНалогов.Госпошлина_ГосрегистрацияОрганизаций);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговУплачиваемыеОтдельно());
	
	Возврат МассивВидовНалогов
	
КонецФункции

Функция НалогиУплачиваемыеПоквартально() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// УСН
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.УСН_Доходы);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.УСН_ДоходыМинусРасходы);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.УСН_МинимальныйНалог);
	
	// ЕСХН
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ЕСХН);
	
	// Прибыль
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НалогНаПрибыль_РегиональныйБюджет);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НалогНаПрибыль_ФедеральныйБюджет);
	
	// Имущественные налоги
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговНаИмущество());
	
	// НДФЛ ИП
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговНДФЛПредпринимателя());
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция НалогиУплачиваемыеЕжемесячно() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// Прибыль агента
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НалогНаПрибыль_НалоговыйАгент);
	
	// Страховые взносы
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРНакопительнаяЧасть);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРСтраховаяЧасть);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ФФОМС);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.СтраховыеВзносыЕдиныйТариф);
	
	// Иностранцы
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ОПСИностранныхРаботников);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ОМСИностранныхРаботников);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ОССИностранныхРаботников);
	
	// НДФЛ агента
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговНДФЛНалоговогоАгента());
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВсеВидыНалоговНДФЛ() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// Дополним НДФЛ агента
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговНДФЛНалоговогоАгента());
	
	// Дополним НДФЛ предпринимателя
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовНалогов, ВидыНалоговНДФЛПредпринимателя());
	
	// Вернем весь НДФЛ
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВидыНалоговНДФЛНалоговогоАгента() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// НДФЛ налогового агента
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛ);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛДивиденды);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛДивидендыСотрудникам);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛДоначисленныйПоРезультатамПроверки);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛДоходыКонтрагентов);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛПрочиеРасчетыСПерсоналом);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛСПревышения);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛДивидендыСПревышения);
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВидыНалоговНДФЛПредпринимателя() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// НДФЛ предпринимателя
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НДФЛ_ИП);
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВидыНалоговНаИмущество() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// Имущество
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.НалогНаИмущество);
	
	// Транспорт
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ТранспортныйНалог);
	
	// Земля
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ЗемельныйНалог);
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

Функция ВидыНалоговСтраховыеВзносы() Экспорт
	
	МассивВидовНалогов = Новый Массив;
	
	// ПФР - кроме добровольных
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРСтраховаяЧасть);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРНакопительнаяЧасть);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРДополнительныйТарифЛЭ);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРДополнительныйТарифШахтеры);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	
	// ФСС - кроме НС и ПЗ и фиксированных взносов
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ФСС);
	
	// ФФОМС
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.ФФОМС);
	
	// Единый тариф
	МассивВидовНалогов.Добавить(Справочники.ВидыНалоговВзносов.СтраховыеВзносыЕдиныйТариф);
	
	Возврат Новый ФиксированныйМассив(МассивВидовНалогов);
	
КонецФункции

#КонецОбласти
